Revit 2024 API
BuiltInFailures.GroupFailures.AdditionalElementsRequired Property
 Grouping the selected elements requires that additional element(s) also be grouped. [Description] To satisfy the grouping requirement, these additional element(s) will be automatically added to the group as well.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AdditionalElementsRequired { get; }
Visual Basic
Public Shared ReadOnly Property AdditionalElementsRequired As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AdditionalElementsRequired {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace